login = input("Введите логин пока вы не введете правильный логин он  будет спрашивать его с вас.     ")
while(login != "DONBAZ"):
    login = input("Это не тот логин попробуйте другого! Введите правильный логин: ")
print("Молодец теперь логин правельный!")
password = input("Введите пароль пока вы не введете правильный пароль он  будет спрашивать его с вас.     ")
while(password != "9"):
    password = input("Это не тот пароль попробуйте другого! Введите правильный пароль: ")
print("Молодец теперь пароль правельный!")
print("Все успегно вы вошли в аккаунт.")