spisoki = ["1.Заход в игру" , "2.ПРохождение первой миссии" , "3.Убийство первого босса" , "4.Заход в подземелье" , "5.Првая прокачка оружия" , "6.Расширение арсенала" , "7.Получение посоха"   , "8.Получение нового легендарного заклинание телепортации"  , "9.Нанятие первого друго-путешественника" ,"10.Поражение в бою с финальным боссом"]
spisoka = ["1.Заход в игру" , "2.ПРохождение первой миссии" , "3.Убийство первого босса" , "4.Заход в подземелье" , "5.Првая прокачка оружия" , "6.Расширение арсенала" , "7.Получение посоха"   , "8.Получение нового легендарного заклинание телепортации"  , "9.Нанятие первого друго-путешественника" ,"10.Поражение в бою с финальным боссом"]
pistol1 = ['Название - цена:','Африканская сетка - 30руб','Императрица - 7096руб','Аквамариновая месть - 3200руб','Элитное снаряжение - 150руб','Вулкан - 1300руб','Повехнастная закалка - 30000руб','Снежный вихрь - 2200руб','Азимов - 1400руб','Кровавый спорт - 4200руб','Топлевный инжектор - 5000руб','Неоновый гонщик - 1500руб','Орбита - 2500руб']
pistol2 = ['Название - цена:','Магний - 300руб','Неонуар - 5000руб','Вой - 700400руб','Азимов - 8000руб','Кибербезопасость - 1800руб','Безлюдный космос - 700руб','Радиационная опасность - 2100руб','Преданный паладин - 900руб','Грифон - 230руб','Тусклые полосы - 185руб','Король драконов - 2800руб','Дождь из пуль - 500руб','Зубная фея - 425руб']
pistol3 = ['Название - цена:','Мортис - 131руб','Неонуар - 1245руб','Африканская сетка - 23руб','Экзоскелет - 50руб','Гадюка - 79руб','Лапки - 120руб','Драгн Лор - 600 000руб','Бог червей - 40руб','Азимов - 4000руб','Медуза - 45000руб','Фобос - 70руб','Элитное снаряжение - 200руб','Скоростной зверь - 1500руб','Бах - 8000руб','Электрический улей - 4000руб']
pistol4 = ['Название - цена:','Объезд - 800руб','Пламя дракона - 1200руб','Мечты Майя - 120руб','Лишайниковая штриховка - 58руб','Некромант - 90руб','Горячечные грёзы - 360руб','Параллакс - 162руб','Мейнфрейм 001 - 167руб','Красный камень - 130руб','Мертвые головы - 420руб','Песчаные дюны - 100руб','Кровь в воде - 2100руб','Большая пушка - 1100руб','Кровавая пелена - 318руб']
pistol5 = ['Название - цена:','Надрыв - 30руб','Кардио - 250руб','Калька - 88руб','Генератор - 32руб','Тот самый контейнер - 33руб','Эпидемия - 80руб','Принудитель - 100руб','Кровавый спорт - 400руб','Армейский блеск - 55руб','Каменная кладка','Зеленый морпех - 50руб','Пятна краски - 400руб','Сайрекс - 200руб']
pistol6 = ['Название - цена:','Чудовищная смесь - 2000руб','Орион - 5000руб','Калька - 300руб','Убийство подтверждено - 6000руб','Извилины - 120руб','Нержавейка - 1200руб','Сыворотка - 2100руб','Неонуар - 1700руб','Цель найдена - 9000руб','Королевский синий - 600руб','Пиксельный камуляж - 226руб','Проводик - 120руб','Закрученный - 82руб']
pistol7 = ['Название - цена:','Золотой карп - 2645руб','Пиксельный камуфляж - 206руб','Нага - 486руб','Поток информации - 4657руб','Кровавая паутина - 1600руб','Код красный - 1600руб','Механо пушка - 700руб','Синяя фанера - 353руб','Гипноз - 6900руб','Рельсотрон - 360руб','Буря на закате - 10080руб','Океанское побережье - 1148руб','Пламя - 25000руб']
pistol8 = ['Название - цена:','Приятель - 115руб','Паслен - 20руб','Хладагент - 48руб','Сказка - 1776руб','Городская опасность - 109руб','Птичьи игры - 237руб','Обезьянье дело - 264руб','Разъяренная толпа - 2000руб','Апельсиновая корка - 50руб','Триумвират - 6900руб','Мигалка - 4999руб','Дань прошлому - 587руб','Медная галактика - 1100руб']
pistol9 = ['Название - цена:','Бульдозер - 75000руб','Топлевный Инжектор - 5053руб','Удаленный доступ - 140руб','Опустошитель - 362руб','Айзек - 450руб','Смешанный камуфляж - 93руб','Ржавые листья - 439руб','Стебель бамбука - 67руб','Смерчь - 44руб','Ветеран - 81руб','Оранжевое Мурано - 234руб','Токсичность - 155руб','Лавина - 143руб']
pistol0 = ['Название - цена:','Африканская сетка - 30руб','Императрица - 7096руб','Аквамариновая месть - 3200руб','Элитное снаряжение - 150руб','Вулкан - 1300руб','Повехнастная закалка - 30000руб','Снежный вихрь - 2200руб','Азимов - 1400руб','Кровавый спорт - 4200руб','Топлевный инжектор - 5000руб','Неоновый гонщик - 1500руб','Орбита - 2500руб','Магний - 300руб','Неонуар - 5000руб','Вой - 700400руб','Азимов - 8000руб','Кибербезопасость - 1800руб','Безлюдный космос - 700руб','Радиационная опасность - 2100руб','Преданный паладин - 900руб','Грифон - 230руб','Тусклые полосы - 185руб','Король драконов - 2800руб','Дождь из пуль - 500руб','Зубная фея - 425руб','Мортис - 131руб','Неонуар - 1245руб','Африканская сетка - 23руб','Экзоскелет - 50руб','Гадюка - 79руб','Лапки - 120руб','Драгн Лор - 600 000руб','Бог червей - 40руб','Азимов - 4000руб','Медуза - 45000руб','Фобос - 70руб','Элитное снаряжение - 200руб','Скоростной зверь - 1500руб','Бах - 8000руб','Электрический улей - 4000руб','Объезд - 800руб','Пламя дракона - 1200руб','Мечты Майя - 120руб','Лишайниковая штриховка - 58руб','Некромант - 90руб','Горячечные грёзы - 360руб','Параллакс - 162руб','Мейнфрейм 001 - 167руб','Красный камень - 130руб','Мертвые головы - 420руб','Песчаные дюны - 100руб','Кровь в воде - 2100руб','Большая пушка - 1100руб','Кровавая пелена - 318руб','Надрыв - 30руб','Кардио - 250руб','Калька - 88руб','Генератор - 32руб','Тот самый контейнер - 33руб','Эпидемия - 80руб','Принудитель - 100руб','Кровавый спорт - 400руб','Армейский блеск - 55руб','Каменная кладка','Зеленый морпех - 50руб','Пятна краски - 400руб','Сайрекс - 200руб','Чудовищная смесь - 2000руб','Орион - 5000руб','Калька - 300руб','Убийство подтверждено - 6000руб','Извилины - 120руб','Нержавейка - 1200руб','Сыворотка - 2100руб','Неонуар - 1700руб','Цель найдена - 9000руб','Королевский синий - 600руб','Пиксельный камуляж - 226руб','Проводик - 120руб','Закрученный - 82руб','Приятель - 115руб','Паслен - 20руб','Хладагент - 48руб','Сказка - 1776руб','Городская опасность - 109руб','Птичьи игры - 237руб','Обезьянье дело - 264руб','Разъяренная толпа - 2000руб','Апельсиновая корка - 50руб','Триумвират - 6900руб','Мигалка - 4999руб','Дань прошлому - 587руб','Медная галактика - 1100руб','Золотой карп - 2645руб','Пиксельный камуфляж - 206руб','Нага - 486руб','Поток информации - 4657руб','Кровавая паутина - 1600руб','Код красный - 1600руб','Механо пушка - 700руб','Синяя фанера - 353руб','Гипноз - 6900руб','Рельсотрон - 360руб','Буря на закате - 10080руб','Океанское побережье - 1148руб','Пламя - 25000руб','Бульдозер - 75000руб','Топлевный Инжектор - 5053руб','Удаленный доступ - 140руб','Опустошитель - 362руб','Айзек - 450руб','Смешанный камуфляж - 93руб','Ржавые листья - 439руб','Стебель бамбука - 67руб','Смерчь - 44руб','Ветеран - 81руб','Оранжевое Мурано - 234руб','Токсичность - 155руб','Лавина - 143руб']
inventory = ['Glock - Ласка','AK-47 - Элитное снаряжение','BIZON - Убийство подтверждено','USP-S - Калька','Граффити - GG','Граффити - WOW!','Наклейки - Gambit']
win = spisoki
lose = spisoka
balance = '13450,86рублей'
spisok = ['Молоко','Огурцы','Помидоры','Мясо','Хлеб','Лук']
playspisok = ['Бои с боссами','В слова','CS GO']
print('Мама: Сходи в магазин и купи продуктов')
vybor = input('Система:От твоего дальнейшего выбора будет разворачиваться события: Пойти или Сесть играть')
while vybor not in ['Пойти','Сесть играть','exit']:
    vybor = input('Система:От твоего дальнейшего выбора будет разворачиваться события: Пойти или Сесть играть')
if vybor == 'Пойти':
    print('Ты решил пойти и мама скинула тебе список')
    for l in spisok:
        print(l)
    vybor = input('Ты пришел и ты должен решить куда идти Пойти на лево или на право')
    while vybor not in ['на лево','на право']:
        vybor = input('Пойти на лево или на право')
    if vybor == 'на лево':
        print('В ближайший час ты ходил по магазину и пытался найти продукты и нашел')
    elif vybor == 'на право':
        print('ты пошел на право и в итоге зашел в тупик и тебе надо решить куда идти теперь на Лево ил на Право')
        vybor = input('Реши куда идти на Лево или на Право сейчас ты в тупике')
        while vybor not in ['на Лево','на Право']:
            vybor = input('на Право или на Лево')
        if vybor == 'на Лево':
            print('Ты смог найти тележку и по итогу нашел рядом и продукты')
        elif vybor == 'на Право':
            print('Ты пошел и нашел все продукты т.к они почему то просто лежали рядом')
if vybor == 'Сесть играть':
    print('Ты сказал что пошел в магазин хотя сам просто сел играть но у тебя есть выбор в какие игры можно поиграть')
    for l in playspisok:
        print(l)
    vybor = input('Осталось выбрать какую-то игру из трех но я помню то что одно из этих игр не работает')
    while vybor not in ['CS GO','Бои с боссами','В слова']:
         vybor = input('Выбери игру CS GO или В слова или Бои с боссами')
    if vybor == 'Бои с боссами':
        print("Ты находишься в подземелье и ты встретил босса.Тебе надо его победить у тебя есть 4 выбора взять Мечь Щит Посох или Заклинание телепортации.От твоего выбора зависит дальнейший путь твоего персонажа")
        vybor = input("Мечь , Щит , Посох , Заклинание телепортации...")
        while vybor not in ["Мечь","Щит","Посох","Заклинание телепортации"]:
            vybor = input("Мечь , Щит , Посох , Заклинание телепортации")
        if vybor == "Мечь":
            print("Ты выбрал мечь твой персонаж вступил в бой и начал бить босса но он перешел во 2 стадию и начал проводить сложные атаки тебе нужно выбрать как тебе провести атаку дальше вот выборы уклон в лево и контр атака или пройти на пролом")
            vybor = input("уклон в лево и контр атака , пройти на пролом...")
            while vybor not in ["уклон в лево и контр атака","пройти на пролом"]:
                vybor = input("уклон в лево и контр атака пройти на пролом")
            if vybor == "пройти на пролом":
                print(lose)
            elif vybor == "уклон в лево и контр атака":
                print(win)
        if vybor == "Щит":
            print("Ты выбрал щит это и в правду не плохое оружие оно защищает тебя но ты не можешь наносить достаточно урона боссу из-за щита но у тебя есть выбор переработать щит и получить полусочетание оружия и защиты в виде полу щита и кинжала или же дальше продолжать атаковать")
            vybor = input("получить полусочетание оружия и защиты в виде полу щита и кинжала , продолжать атаковать...")
            while vybor not in ["получить полусочетание оружия и защиты в виде полу щита и кинжала" , "продолжать атаковать"]:
                vybor = input("получить полусочетание оружия и защиты в виде полу щита и кинжала , продолжать атаковать")
            if vybor == "получить полусочетание оружия и защиты в виде полу щита и кинжала":
                print(win)
            elif vybor == "продолжать атаковать":
                print(lose)
        if vybor == "Посох":
            print(lose)
        if vybor == "Заклинание телепортации":
            print("Ты решил покинуть подземелье  тебе будут доступны варианты прокачки и когда ты прокачаешься ты сможешь дать отпор боссу вот варианты рубить деревья или пойти атаковать других мобов")
            vybor = input("рубить деревья  ,  атаковать других мобов...")
            while vybor not in ["рубить деревья" , "атаковать других мобов"]:
                vybor = input("рубить деревья , атаковать других мобов")
            if vybor == "рубить деревья":
                print(win)
            elif vybor == "атаковать других мобов":
                print(lose)
    if vybor == 'CS GO':
        print('К сожалению именно CS GO оказалась той самой не работующей игрой но в принципе нежели поиграть можно просто посидеть на торгововой площадке')
        vybor = input('Посидеть на торговой площадке')
        while vybor not in ['Посидеть на торговой площадке']:
            vybor = input('Посидеть на торговой площадке')
        if vybor == 'Посидеть на торговой площадке':
            print('Ты решил посидеть на торговой площадке ты можешь выбрать какое оружие тебе интересно')
            vybor = input('АК-47 или М4A4 или AWP или SSG08 или SCAR-20 или USP-S или DESRET EAGLE или FIVE-SEVEN или TEC-9 или весь список')
            while vybor not in ['AK-47','M4A4','AWP','SSG08','SCAR-20','USP-S','DESERT EAGLE','FIVE-SEVEN','TEC-9','ВЕСЬ СПИСОК']:
                vybor = input('AK-47 или M4A4 или AWP или SSG08 или SCAR-20 или USP-S или DESRET EAGLE или FIVE-SEVEN или TEC-9 или ВЕСЬ СПИСОК')
            if vybor == 'AK-47':
                for prod in pistol1:
                    print(prod)
            elif vybor == 'M4A4':
                for prod in pistol2:
                    print(prod)
            elif vybor == 'AWP':
                for prod in pistol3:
                    print(prod)
            elif vybor == 'SSG08':
                for prod in pistol4:
                    print(prod)
            elif vybor == 'SCAR-20':
                for prod in pistol5:
                    print(prod)
            elif vybor == 'USP-S':
                for prod in pistol6:
                    print(prod)
            elif vybor == 'DESERT EAGLE':
                for prod in pistol7:
                    print(prod)
            elif vybor == 'FIVE-SEVEN':
                for prod in pistol8:
                    print(prod)
            elif vybor == 'TEC-9':
                for prod in pistol9:
                    print(prod)
            elif vybor == 'ВЕСЬ СПИСОК':
                for prod in pistol0:
                    print(prod)
            vybor = input('Ты увидел список хочешь ли ты КУПИТЬ скин или ПОСМОТРЕТЬ БАЛАНС или вообще ВЫЙТИ С ИГРЫ ну или ПРОСМОТРЕТЬ ИНВЕНТАРЬ?')
            while vybor not in ['КУПИТЬ','ВЫЙТИ С ИГРЫ','ПОСМОТРЕТЬ БАЛАНС','ПРОСМОТРЕТЬ ИНВЕНТАРЬ']:
                vybor = input('КУПИТЬ ВЫЙТИ С ИГРЫ ПОСМОТРЕТЬ БАЛАНС ПРОСМОТРЕТЬ ИНВЕНТАРЬ')
            if vybor == 'КУПИТЬ':
                print('Извините из-за нынешней ситуации вы не можете не пополнить счет не воспользоваться услугами STEAM приносим свои изменения')
            elif vybor == 'ВЫЙТИ С ИГРЫ':
                print('                          ')
            elif vybor == 'ПОСМОТРЕТЬ БАЛАНС':
                print(balance)
            elif vybor == 'ПРОСМОТРЕТЬ ИНВЕНТАРЬ':
                for prod in inventory:
                    print(prod)
            